app/controllers/products_controller.rb

SELECT MAX(`products`.`sort`) AS max_id FROM `products`
SELECT `products`.* FROM `products`   ORDER BY `products`.`sort` ASC
---
  def index
  @products = Product.order(:sort).all

INSERT INTO `products` (`created_at`, `description`, `name`, `price`, `quantity`, `sort`, `updated_at`) VALUES ('2021-11-26 12:25:15', 'sdas', 'sd', 21, 1, 1, '2021-11-26 12:25:15')
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE `products` SET `price` = 2, `quantity` = 2, `updated_at` = '2021-11-26 12:39:15' WHERE `products`.`id` = 10
---
  def update
    respond_to do |format|
      if @product.update(product_params)

SELECT  `products`.* FROM `products`  WHERE ('name') LIMIT 1
---
    def set_product
      @product = Product.find_by(params[:id])